In [1]:
import numpy as np
import pandas as pd

In [2]:
sözlük = {"A": [10, np.nan, np.nan, 40], "B": [15, np.nan, 20, 25],
         "C": [10,30,15,30], "D": [np.nan, 20, 30 , 40]}

In [3]:
sözlük

{'A': [10, nan, nan, 40],
 'B': [15, nan, 20, 25],
 'C': [10, 30, 15, 30],
 'D': [nan, 20, 30, 40]}

In [8]:
tablo = pd.DataFrame(sözlük, index = ["X","Y","Z","T"])

In [9]:
tablo

      A     B   C     D
X  10.0  15.0  10   NaN
Y   NaN   NaN  30  20.0
Z   NaN  20.0  15  30.0
T  40.0  25.0  30  40.0

In [10]:
#dropna()
tablo.dropna()

      A     B   C     D
T  40.0  25.0  30  40.0

In [13]:
tablo.dropna(axis = 1)

    C
X  10
Y  30
Z  15
T  30

In [14]:
# fillna()
tablo.fillna(15)

      A     B   C     D
X  10.0  15.0  10  15.0
Y  15.0  15.0  30  20.0
Z  15.0  20.0  15  30.0
T  40.0  25.0  30  40.0

In [15]:
tablo.fillna("Eksik Veri")

            A           B   C           D
X          10          15  10  Eksik Veri
Y  Eksik Veri  Eksik Veri  30          20
Z  Eksik Veri          20  15          30
T          40          25  30          40